Revit 2027 API
HostObjectSubcomponentInfo Methods
The HostObjectSubcomponentInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCurveLoop |  Gets the CurveLoop representing the base profile curve loop of the roof or floor slab
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPlane |  Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace